{
    "random-order": false,
    "messages": {
        "_default": {
            "en": "Try again! If you are not sure what to look for, check out the help for more information.",
            "fr": "Try again! If you are not sure what to look for, check out the help for more information. (fr)"
        }
    },
    "tutorials": [
        {
            "subject": {
                "url": "http://i.imgur.com/yZrJpI3.jpg",
                "source": "http://imgur.com/r/earthporn/yZrJpI3"
            },
            "assertions": {
                "isWaterVisible": {
                    "expects": "yes",
                    "messages": {
                        "yes": {
                            "en": "Well done! There is a water-body in this photo.",
                            "fr": "Well done! There is a water-body in this photo. (fr)"
                        },
                        "no": {
                            "en": "Try again. Are you sure there is no water? Check out the help for information on what you should be looking for.",
                            "fr": "Try again. Are you sure there is no water? Check out the help for information on what you should be looking for. (fr)"
                        }
                    }
                },
                "waterColor": {
                    "expects": "AQUA_BLUE",
                    "messages": {
                        "AQUA_BLUE": {
                            "en": "Correct! The water has an aqua blue hue.",
                            "fr": "Correct! The water has an aqua blue hue. (fr)"
                        }
                    }
                },
                "smallPoolsOfWaterVisible": {
                    "expects": "no",
                    "messages": {
                        "no": {
                            "en": "Well done! There are no small pools of water in this photo.",
                            "fr": "Well done! There are no small pools of water in this photo. (fr)"
                        },
                        "yes": {
                            "en": "Whoa! Are you sure that you see a small pool of water? Check out the help for information on what you should be looking for.",
                            "fr": "Whoa! Are you sure that you see a small pool of water? Check out the help for information on what you should be looking for. (fr)"
                        }
                    }
                },
                "largeBodyOfWaterVisible": {
                    "expects": "yes",
                    "messages": {
                        "yes": "Correct! You are looking at the North Pacific Ocean, which is a (very) large water body.",
                        "no": "Hmmm, are you sure? Check out the help for information on what you should be looking for."
                    }
                },
                "name": {
                    "autocomplete": true,
                    "expects": "A little known secret ...",
                    "messages": {
                        "_default": {
                            "en": "Due to the nature of the input (non-deterministic) required for this question, it has been answered for you.",
                            "fr": "Due to the nature of the input (non-deterministic) required for this question, it has been answered for you. (fr)"
                        },
                        "A little known secret ...": {
                            "en": "That's right, Jack!",
                            "fr": "That's right, Jack! (fr)"
                        }
                    }
                }
            }
        }
    ]
}
